import type { Song, SongTitle } from "@/features/guide/lib/types";

const darken: SongTitle = {
  jp: "暗く黒く",
  kr: "어둡게 검게",
  en: "Darken",
};

const song: Song = {
  id: "darken",
  title: darken,
  youtubeId: "Al_9DytnKnY",
  lyrics: [],
};

export default song;

/**
触れたくて 震えてく声が
후레타쿠테 후루에테쿠 코에가
닿고 싶지만 떨리는 목소리가

勘違いしては 自分になっていく
칸치가이시테와 지분니 낫테이쿠
착각하고서는 나 자신이 되어가

成りたくて鳴らせないが息絶えても
나리타쿠테 나라세나이가 이키타에테모
이루고 싶어도 울릴 수 없지만 숨이 끊겨도

確かめるまで 終わらせないで
타시카메루마데 오와라세나이데
확인할 때까지 끝내지 말아줘

ただ黙っていた
타다 다맛테이타
그저 잠자코 있었어

想ってるほど 堪えられた
오못테루호도 코라에라레타
생각하는 만큼 견뎌낼 수 있었어

冷え切った視界で今日を燃やしてく
히에킷타 시카이데 쿄오오 모야시테쿠
차갑게 식은 시야로 오늘을 불태워 가

未読にした 美学でよかった
미도쿠니 시타 비가쿠데 요캇타
아직 읽지 못한 미학이라서 다행이야

だいじょばないって言えた程
다이죠바나잇테 이에타호도
안 괜찮다 얘기 할 수 있을 정도로

些細な痛み 割り切ったけど
사사이나 이타미 와리킷타케도
사소한 아픔은 받아들였지만

君に出会って 赦されてく
키미니 데앗테 유루사레테쿠
너를 만나 용서받아 가

全然取れやしない
젠젠 토레야시나이
전혀 잡히지 않는

やつが暗く黒く 塗り潰したとしても
야츠가 쿠라쿠 쿠로쿠 누리츠부시타토 시테모
녀석이 어둡게 검게 덧칠한다고 해도

決して奪われない
켓시테 우바와레나이
결코 빼앗기지 않아

インスタントな存在でも
인스탄토나 손자이데모
인스턴트같은 존재라도

見えなくても此処にある
미에나쿠테모 코코니 아루
보이지 않아도 이곳에 있어

守ってたいなんて一切合切自我の煩悩で
마못테타이난테 잇사이 갓사이 지가노 본노오데
지키고 싶다는건 전부 자아의 번뇌로

控えめになって 心をポイ捨てしても
히카에메니 낫테 코코로오 포이스테시테모
부담스러워져서 마음을 내다버려도

きっと違うけど
킷토 치가우케도
전혀 달랐겠지만

学んでしまった気づいてしまった
마난데시맛타 키즈이테시맛타
학습하고 말았어 알아버리고 말았어

備えられた孤独が こんなに尊いならば
소나에라레타 코도쿠가 콘나니 토오토이나라바
갖추어진 고독이 이토록 귀중하다면

疑う必要はない信じてる必要もない
우타가우 히츠요오와 나이 신지테루 히츠요오모 나이
의심할 필요는 없어 믿고 있을 필요도 없어

連鎖よ続け
렌사요 츠즈케
연쇄야 이어져라

在り来たりな儀式もお上手に
아리키타리나 기시키모 오죠오즈니
흔해빠진 의식도 능숙하게

切磋琢磨に踊れ秒読み
셋사타쿠마니 오도레 뵤오요미
절차탁마에 춤춰 초읽기

トライアングルな縁に浸っても
토라이앙구루나 엔니 히탓테모
트라이앵글의 연에 젖어들어도

何処に居ても場所疑うけど
도코니 이테모 바쇼 우타가우케도
어디에 있건 장소를 의심하겠지만

鍛えられた細胞 崩してよ
키타에라레타 사이보오 쿠즈시테요
불어난 세포를 허물어 줘

この人生が有ること 許してよ
코노 진세에가 아루 코토 유루시테요
이 인생이 있는 것을 용서해 줘

今まで見てきたもの 全部背負って
이마마데 미테키타 모노 젠부 세옷테
지금까지 보아온 것 전부 떠안고서

生きてく怪我させて
이키테쿠 케가사세테
살아가 상처입혀가며

守ってたいなんて一切合切自我の煩悩で
마못테타이난테 잇사이 갓사이 지가노 본노오데
지키고 싶다는건 전부 자아의 번뇌로

控えめになって 心をポイ捨てしても
히카에메니 낫테 코코로오 포이스테시테모
부담스러워져서 마음을 내다버려도

きっと違うけど
킷토 치가우케도
전혀 달랐겠지만

学んでしまった気づいてしまった
마난데시맛타 키즈이테시맛타
학습하고 말았어 알아버리고 말았어

備えられた孤独が
소나에라레타 코도쿠가
갖추어진 고독이

こんなに尊いならば
콘나니 토오토이나라바
이토록 귀중하다면

疑う必要はない信じてる必要もない
우타가우 히츠요오와 나이 신지테루 히츠요오모 나이
의심할 필요는 없어 믿고 있을 필요도 없어

連鎖よ続け
렌사요 츠즈케
연쇄야 이어져라

全然取れやしない
젠젠 토레야시나이
전혀 잡히지 않는

やつが暗く黒く 塗り潰したとしても
야츠가 쿠라쿠 쿠로쿠 누리츠부시타토 시테모
녀석이 어둡게 검게 덧칠한다고 해도

決して奪われない
켓시테 우바와레나이
결코 빼앗기지 않아

インスタントな世界でも
인스탄토나 세카이데모
인스턴트적인 세계라도

触れなくても此処にある
후레나쿠테모 코코니 아루
닿지 않아도 이곳에 있어

叶っていたいも 勝っていたいも
카낫테이타이모 마삿테이타이모
이루고 싶어도 이기고 싶어도

時間の翻弄で
지칸노 혼로오데
시간의 농락으로

目指してた果てに 行き着いた先
메자시테타 하테니 이키츠이타 사키
목표했던 지점에 다다른 끝에서야

満たす孤独もあるのかな
미타스 코도쿠모 아루노카나
채워지는 고독도 있는 걸까

止まってしまって わかりすぎたって
토맛테시맛테 와카리스기탓테
멈춰버렸고 너무 많이 알아버려서

選び変える勇気が
에라비카에루 유우키가
바꿔선택할 용기가

こんなに尊いならば
콘나니 토오토이나라바
이토록 고귀한 거라면

疑う必要はない 騙し合う必要もない
우타가우 히츠요오와 나이 다마시아우 히츠요오모 나이
의심할 필요는 없어 서로 속일 필요도 없어

連鎖よ続け
렌사요 츠즈케
연쇄야 이어져라
 */
